// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели,
// и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

Console.WriteLine("Введите номер дня недели от 1 до 7");
int wd =  Convert.ToInt32(Console.ReadLine());
if (wd <= 5 ) 
{
  Console.WriteLine("Это будний день");   
}
if (wd == 6 || wd == 7  ) 
{
  Console.WriteLine("Это выходной день"); 
} 

if (wd < 1 || wd >= 8 ) 
{
  Console.WriteLine("Вы не верно ввели номер дня недели"); 
} 